[
  {
    "state_cnt": 0,
    "title": "Intro",
    "message": ""
  },
    {
    "state_cnt": 1,
    "title": "Start",
    "message": "To begin the annotation process - press the \"START\" button."
  },
    {
    "state_cnt": 2,
    "title": "Highlighting",
    "message": "Choosing aligning spans is done by highlighting them. <br/>To do that, click the first word and hold it until all the span is covered (the covered span will be colored orange to guide you)."
  },
      {
    "state_cnt": 3,
    "title": "Un-Highlighting",
    "message": "To un-highlighting: <b>hold the ctrl key (for windows) or the alt key (for MacOS)</b> and highlight the relevant span in the same manner described in the previous section."
  },
      {
    "state_cnt": 4,
    "title": "Work Sentence-by-Sentence",
    "message": "You will work one summary sentence at a time, and you won't be able to proceed to the next sentence before highlighting all the current sentence. To help you focus, the current sentence will be mark by red box."
  },
      {
    "state_cnt": 5,
    "title": "Confirm Alignments",
    "message": "When you are satisfied with an alignment, press the \"CONFIRM\" button. Doing so will save the alignment (its color will be changed to a faded yellow)."
  },
      {
    "state_cnt": 6,
    "title": "Bold - Full Sentence",
    "message": "To help you find the alignments, document words related to the current summary sentence will be in bold."
  },
      {
    "state_cnt": 7,
    "title": "Bold - Span",
    "message": "When a summary span is chosen (highlighted), the bolding narrows down to words related to the highlighted summary span, to help you better focus. <br/><b>For example</b>, the bolding helps us see that the currently highlighted span is aligned to a part of the first sentence, and to another span further along."
  },
      {
    "state_cnt": 8,
    "title": "Bolding Control",
    "message": "In addition to the default behavior, you can also control the bolding level you prefer, through the red slider at the top-right corner of the screen. <br/>you can alter between:<ul><li>No bolding (leftmost)</li><li>Currently highlighted span bolding (middle)</li><li>Current sentence bolding (rightmost)</li></ul>"
  },
      {
    "state_cnt": 9,
    "title": "Single Word Hint",
    "message": "If you want to find document words related to a specific summary word, without turning off the bolding option, <b>hover</b> over it. <br/>This will \"activate\" the related document words (turn them <b style=\"color:red\">red</b>)."
  },
      {
    "state_cnt": 10,
    "title": "Old Alignments",
    "message": "Every alignment which is approved, is saved and can be seen with a faded-yellow background. <br/>You can control how many of the old alignments to see, by toggling the blue slider adjacent to the bolding-control slider. <br/>You can alter between: <ul><li>No previous alignments (leftmost)</li><li>Only Current sentence's previous alignments (middle)</li><li>All previous alignments (rightmost)</li></ul>"
  },
      {
    "state_cnt": 11,
    "title": "Revise",
    "message": "If at any given point you regret one of your old alignments, you have the option to revise it. <br/>To do that:<ol><li>hit \"REVISE\" to enter revision mode.</li><li>Hover over the old alignments to find the one you want to fix (when hovered over, the alignments will \"unfade\" to guide you).</li><li>Click the Alignment you want to fix.</li><li>Fix it.</li><li>If you are satisfied, press \"CONFIRM\". Alternatively, if you regret, press \"BACK\" to discard all your changes.</li></ol> You can do steps 2-5 multiple times. <br/>When you are satisfied with all your revisions, press \"EXIT REVISION\" to leave the revision mode and return to the normal annotation mode."
  },

  {
    "state_cnt": 12,
    "title": "End of Sentence",
    "message": "Once you highlighted a full sentence, you will automatically be prompted to proceed to the next sentence.<br/> Clicking the \"NEXT SENTENCE\" button will save the currently chosen alignment and will proceed to the next sentence."
  },
      {
    "state_cnt": 13,
    "title": "Submit",
    "message": "Once you are finished highlighting the summary, you will be prompted to submit your work. <br/>Clicking the \"SUBMIT\" button will save your last alignment and submit your whole work."
  },
        {
    "state_cnt": 14,
    "title": "Unalignable Spans",
    "message": "Rarely there would be pieces of information in the summary that wouldn't have any alignment in the document. <br/>In such cases, highlight the piece of information and submit it unaligned (with the document highlighting-free). <br/>Notice that the \"CONFIRM\" button appears with \"NO ALIGN\" and in a different color (the same applies for the \"NEXT SENTENCE\" and the \"SUBMIT\" buttons). <br/>Doing this will prompt a pop-up message asking if you are sure this span is un-alignable."
  },
  {
    "state_cnt": 15,
    "title": "Some Basic Instructions",
    "message": ""
  }
]



